absorb
ingest
take_in
___
accept
buy
understand
encourage
discourage
disprefer
reject
repent
rue
___
accompany
conduct
escort
guide
lead
misdirect
shepherd
steer
___
acquiesce
submit
give_in
bow
defer
accede
succumb
yield
capitulate
___
addict
bias
dispose
incline
predispose
woo
slant
___
adapt
accommodate
conform
adjust
gear
fit
readjust
readapt
assimilate
___
admire
adore
appreciate
applaud
bear
bewail
cherish
deify
detest
disbelieve
esteem
exalt
fancy
favor
grudge
idolize
miss
mistrust
prefer
affirm
reaffirm
prize
respect
relish
revere
savor
stand
support
tolerate
treasure
trust
value
venerate
worship
abhor
deplore
distrust
dread
envy
execrate
lament
loathe
mourn
pity
resent
rue
believe
suffer
despise
disdain
dislike
regret
like
love
enjoy
fear
hate
___
admit
allow
exclude
include
permit
receive
welcome
___
assume
adopt
take_over
take_on
take
___
alert
assure
brief
educate
encourage
inform
notify
admonish
advise
caution
counsel
instruct
warn
___
allow
approve
permit
sanction
tolerate
___
intermarry
couple
incorporate
integrate
match
overlap
amalgamate
coalesce
consolidate
intermingle
conjoin
entangle
muddle
pair
team
affiliate
associate
compare
confederate
confuse
incorporate
integrate
total
identity
alternate
crisscross
entwine
interchange
interconnect
interlace
interlink
interlock
intersperse
intertwine
interweave
mate
unite
coalesce
coincide
conflate
consolidate
contrast
correlate
harmonize
intermingle
interrelate
repackage
rhyme
unify
oppose
introduce
figure
marry
remarry
wed
engage
___
abash
affect
afflict
affront
aggravate
aggrieve
agitate
agonize
alarm
alienate
amaze
amuse
anger
annoy
antagonize
appall
appease
arouse
assuage
astonish
astound
awe
baffle
befuddle
beguile
bewilder
bewitch
boggle
bore
bother
browbeat
bug
calm
captivate
chagrin
charm
cheer
chill
cloy
comfort
concern
confound
confuse
console
content
convince
cow
crush
cut
daunt
daze
dazzle
deject
delight
demolish
demoralize
depress
devastate
disappoint
disarm
discombobulate
discomfit
disconcert
discompose
discourage
disgrace
disgruntle
disgust
dishearten
dishonour
disillusion
dismay
dispirit
displease
disquiet
dissatisfy
distract
distress
disturb
divert
dumbfound
elate
electrify
embarrass
embolden
enchant
encourage
enervate
enflame
engage
engross
enlighten
enliven
enrage
enrapture
entertain
enthrall
enthuse
entice
entrance
exasperate
excite
exhaust
exhilarate
fascinate
fatigue
faze
flabbergast
flatter
floor
flummox
fluster
fox
frighten
frustrate
fuddle
gall
galvanize
gladden
gratify
grieve
harass
harm
haunt
hearten
horrify
humble
humiliate
hurt
hypnotize
impair
impress
incense
inflame
infuriate
inspire
insult
interest
intimidate
intoxicate
intrigue
invigorate
irk
irritate
jade
jar
jollify
jolt
lull
madden
menace
mesmerize
miff
misguide
molest
mollify
mortify
move
muddle
mystify
nauseate
nettle
nonplus
numb
obsess
occupy
offend
outrage
overawe
overwhelm
pacify
pain
peeve
perplex
perturb
pester
pique
placate
plague
please
preoccupy
provoke
puzzle
quench
rag
rankle
ravish
reassure
recharge
refresh
rejuvenate
relax
relieve
repel
repulse
revitalize
revolt
rile
ruffle
sadden
satiate
satisfy
scandalize
scare
shake
shame
shock
sicken
sober
solace
soothe
spellbind
spook
stagger
startle
stimulate
sting
stir
strike
stump
stun
stupefy
surprise
tantalize
taunt
tease
tempt
terrify
terrorize
threaten
thrill
throw
tickle
tire
titillate
torment
torture
touch
transfix
transport
trouble
try
unnerve
unsettle
uplift
upset
vex
weary
worry
wound
wow
roil
smite
___
baa
bark
bay
bellow
blat
bleat
bray
buzz
cackle
call
caw
chatter
cheep
chirp
chirrup
chitter
cluck
coo
croak
crow
cuckoo
drone
gobble
growl
grunt
hee-haw
hiss
honk
hoot
howl
ki-yi
low
meow
mew
moo
neigh
oink
peep
pipe
purr
quack
roar
rooroo
scrawk
squawk
squeak
squeal
stridulate
trill
tweet
twitter
wail
warble
whimper
whinny
whistle
woof
yap
yell
yelp
yip
yowl
boom
rattle
groan
ululate
moan
rumble
screech
snarl
thunder
trumpet
wheeze
whine
___
niggle
grate
jar
appeal
matter
___
appear
arise
awake
awaken
break
burst
coalesce
come
dawn
derive
develop
emanate
emerge
erupt
evolve
exude
flow
form
grow
gush
irrupt
issue
materialize
open
plop
pop_up
reappear
re-emerge
result
rise
show_up
spill
spread
spring_up
steal
stem
stream
supervene
surge
take_shape
wax
___
appoint
coronate
crown
designate
elect
install
proclaim
mark
ordain
adopt
upgrade
reelect
want
name
nominate
___
analyse
analyze
appraise
assay
assess
audit
examine
evaluate
feel_out
go_over
inspect
investigate
peruse
proofread
regard
review
scan
scrutinize
study
surveil
survey
watch
___
bend
bow
crouch
flop
hang
hunch
hunch_up
kneel
lean
lie
lie_down
perch
plop
rise
sit
sit_down
slouch
slump
sprawl
squat
squat_down
stand
stand_up
stoop
straddle
___
avoid
boycott
circumvent
dodge
duck
elude
eschew
evade
forgo
shun
sidestep
___
banish
deport
evacuate
expel
extradite
recall
recuse
remove
shanghai
boot
___
base
establish
ground
found
build
construe
___
consult
contend
exile
argue
bargain
battle
bicker
brawl
clash
combat
compete
conflict
correspond
communicate
dicker
differ
disagree
dispute
duel
feud
fight
joust
quarrel
quibble
refight
scuffle
skirmish
spar
spat
struggle
squabble
tilt
tussle
vie
war
wrangle
wrestle
___
come
come_out
turn
get
go
grow
fall
turn_up
become
end_up
leave
___
beg
ask
request
supplicate
importune
___
go_on
pledge
proceed
begin
start
start_off
commence
recommence
resume
undertake
___
attire
clad
garb
outfit
robe
___
bend
crease
crinkle
crumple
distend
flex
fold
furrow
hyperextend
roll
round
rumple
scrunch
splay
straighten
stretch
unfold
unfurl
unroll
unwind
warp
wrinkle
unbend
___
benefit
profit
___
antique
berry
birdnest
blackberry
clam
crab
fish
fowl
grouse
hay
log
mushroom
nest
nut
oyster
pearl
prawn
rabbit
scollop
seal
shark
shrimp
snail
snipe
sponge
whale
whelk
whore
hawk
___
amerce
bet
bill
charge
fine
invoice
mulct
overcharge
save
scrimp
spare
tax
tip
undercharge
wager
___
convulse
cower
quake
quiver
shake
shiver
shudder
tremble
writhe
buck
fidget
flap
gyrate
jiggle
kick
rock
squirm
sway
teeter
totter
twitch
waggle
wiggle
wobble
wriggle
___
bob
braid
brush
clip
coldcream
comb
condition
crimp
crop
curl
cut
dye
file
gel
henna
highlight
lather
manicure
part
perm
paint
plait
pluck
powder
rinse
rouge
set
shampoo
soap
style
talc
tease
towel
trim
tweeze
wave
wax
___
break
break_apart
break_down
break_up
chip
cleave
crack
crash
crush
dissolve
fissure
fracture
fragment
rend
rive
rip
shatter
shred
sliver
smash
snap
splinter
split
tear
___
barf
bleed
dribble
drool
pee
piss
puke
shit
spit
sweat
throw_up
vomit
weep
breathe
cough
cry
defecate
expectorate
retch
slobber
urinate
hawk
___
take
bring
___
arrange
assemble
bake
bead
blow
cast
chisel
churn
compile
cook
crochet
develop
embroider
erect
fashion
fold
forge
formulate
grind
grow
hack
hammer
knit
mold
pound
reassemble
refashion
roll
sculpture
sew
spin
stitch
weave
whittle
build
carve
cut
make
remake
sculpt
shape
___
bristle
bulge
buzz
hum
hyperventilate
seethe
___
hit
run
bang
bash
brush
bump
butt
clang
clash
clatter
collide
crack
crash
crunch
hammer
knock
ram
rap
slam
slap
smack
smash
squash
strike
thud
thump
___
aromatize
asphalt
bait
black
blanket
blindfold
board
bread
brick
bridle
bronze
butter
buttonhole
calk
camouflage
cap
carpet
caulk
chrome
clay
cloak
coal
cork
crown
crumb
diaper
dope
drug
feather
fence
flour
forest
frame
frost
fuel
glaze
gag
garland
gas
gild
glass
glove
graffiti
grass
gravel
grease
groove
halter
harness
hat
heel
ice
ink
label
leash
leaven
lipstick
lubricate
mantle
mulch
muzzle
nickel
oil
ornament
paint
panel
paper
parquet
patch
pepper
perfume
plank
plaster
poison
polish
pomade
poster
postmark
powder
punctuate
putty
robe
roof
rosin
rouge
rut
saddle
salt
salve
sand
scent
seed
sequin
shawl
shingle
shoe
shutter
side
silver
slate
slime
slipcover
sod
soil
sole
spice
stain
starch
stopper
stress
string
stucco
sugar
sulphur
tag
tar
tarmac
tassel
thatch
ticket
tile
tinsel
top
turf
varnish
veil
veneer
wallpaper
water
wax
wharf
whitewash
wreathe
yoke
zipcode
insulate
sauce
___
multiply
advance
appreciate
balloon
climb
decline
decrease
depreciate
diminish
drop
dwindle
explode
fall
fluctuate
gain
grow
increase
jump
move
mushroom
plummet
plump
plunge
retreat
rocket
rise
seesaw
shift
skyrocket
slide
slip
soar
surge
swing
tumble
vary
dip
lower
swell
___
calve
cub
fawn
foal
kitten
lamb
litter
pup
spawn
whelp
___
butcher
judge
lawyer
midwife
model
prostitute
soldier
volunteer
whore
babysit
boss
bully
butler
caddy
captain
champion
chaperone
chauffeur
clerk
coach
cox
crew
doctor
emcee
escort
guard
host
mother
nurse
partner
pilot
pioneer
police
referee
shepherd
skipper
sponsor
tailor
tutor
umpire
understudy
usher
valet
witness
star
___
mind
care
worry
wonder
___
carry
drag
draw
haul
heft
hoist
lug
nudge
pull
run
schlep
tote
tow
tug
yank
heave
kick
push
shove
thrust
___
bruise
chip
cleave
crumble
crumple
crunch
crush
cube
dent
dice
fillet
flake
flatten
gash
gouge
grate
grind
mangle
mash
mince
nick
notch
perforate
pulverize
quarter
scollop
scrunch
shred
slice
slit
smash
squash
squish
trench
bore
carve
chop
crop
crumb
drill
file
lance
mill
mangle
mow
pink
punch
prune
scollop
sand
spear
tool
tread
___
blanch
blench
faint
pale
sicken
black_out
swoon
doze_off
drift_off
konk_out
nod_off
pass_out
zonk_out
___
count
depict
detail
envision
interpret
moot
peg
picture
pigeonhole
paint
recast
redraw
specify
stereotype
typecast
bill
cast
diagnose
certify
praise
hail
regard
treat
rank
take
perceive
judge
adopt
class
classify
select
subselect
pidgeonhole
stamp
characterize
conceive
see
view
know
underestimate
portray
define
describe
represent
accept
envisage
identify
imagine
visualize
remember
recollect
report
reveal
___
chase
follow
pursue
shadow
tail
track
trail
___
bereave
break
cleanse
cure
denude
deplete
depopulate
deprive
despoil
disabuse
disarm
disencumber
dispossess
divest
purge
purify
ransack
relieve
render
rid
rifle
strip
unburden
wean
whitewash
bleed
cheat
defraud
rob
sap
gull
fleece
cull
bilk
burgle
con
cozen
drain
ease
milk
mulct
plunder
swindle
___
chew
chomp
crunch
gnaw
gum
masticate
munch
nibble
pick
peck
lick
teethe
lap
sip
slurp
suck
___
chat
chatter
chitchat
confer
converse
gab
gossip
jest
joke
palaver
rap
schmooze
yak
argue
debate
discuss
___
classify
class
constellate
sort
isolate
reclassify
group
regroup
bracket
lump
chunk
grade
number
catalogue
sort_out
separate
seed
categorize
code
recode
___
clean
hollow
clear
drain
empty
___
adhere
cleave
cling
___
loop
roll
rotate
spin
swirl
twine
whirl
wind
curl
coil
hook
swing
twirl
twist
___
color
distemper
dye
enamel
glaze
japan
lacquer
paint
repaint
shellac
spraypaint
stain
starch
tint
varnish
___
bellyache
bitch
boast
brag
caterwaul
complain
crab
gripe
grouch
grouse
grumble
kvetch
moan
object
whine
___
accomplish
achieve
complete
discontinue
quit
___
misconstrue
misinterpret
misunderstand
misapprehend
understand
grasp
comprehend
apprehend
follow
fathom
know
___
comprise
compose
make
make_up
constitute
form
comprise
consist_of
encompass
contain
___
block
cloister
conceal
curtain
impound
isolate
quarantine
repress
screen
seclude
sequester
shelter
suppress
hide
___
confess
admit
acknowledge
fess_up
proclaim
reveal
___
charge
institutionalize
incarcerate
hospitalize
detain
jail
imprison
jug
hold
immure
commit
recommit
send
confine
___
face
confront
head_on
undertake
tackle
take_on
set_about
go_about
approach
brave
handle
intercept
target
rival
counter
pre-empt
combat
breast
___
allow
believe
conjecture
deny
determine
doubt
expect
feel
foreknow
foresee
foretell
guess
hold
infer
know
presume
prophesy
realize
repute
recognize
speculate
surmise
suspect
swear
trust
mean
vaticinate
anticipate
prognosticate
admit
affirm
assert
attest
aver
avow
avouch
claim
confirm
contend
discover
grant
guarantee
maintain
observe
reaffirm
reassert
show
___
view
acknowledge
deem
esteem
rate
reckon
report
know
recognize
see
consider
remember
imagine
suspect
think
feel
suppose
posit
believe
___
ally
collaborate
collude
conspire
discriminate
legislate
partner
protest
rebel
retaliate
scheme
sin
team_up
befriend
___
use
consume
pass
kill
reuse
spend
squander
waste
___
bestride
blanket
border
bound
bracket
bridge
cap
circle
cloak
cover
edge
encircle
enclose
encompass
engulf
envelop
fence
fill
flank
follow
forgo
frame
head
hug
line
neighbor
overcast
overhang
precede
predate
rim
ring
skirt
span
straddle
support
surmount
surround
top
traverse
underlie
wreathe
enshroud
veil
abut
adjoin
cross
hit
intersect
meet
touch
dominate
___
continue
___
betroth
forgo
lose
refer
relinquish
remit
resign
restore
gift
hand_out
pass_out
shell_out
abnegate
disseminate
distribute
administer
circularize
contribute
donate
forfeit
resubmit
sacrifice
submit
surrender
disburse
extend
proffer
return
transfer
reimburse
___
advert
come_around
fall
get
get_around
get_down
go_back
resort
return
revert
settle_down
shift
take
turn
change_over
convert
move_over
switch
switch_over
___
bake
barbecue
barbeque
blanch
boil
braise
broil
brown
char
charbroil
charcoal-broil
coddle
cook
crisp
deep-fry
french-fry
fry
grill
hardboil
heat
microwave
oven-fry
oven-poach
overbake
overcook
overheat
pan-broil
pan-fry
parboil
parch
percolate
perk
pickle
plank
poach
pot-roast
reheat
rissole
roast
saute
scald
scallop
sear
shirr
simmer
softboil
steam
steam-bake
steep
stew
stir-fry
toast
warm_up
___
collaborate
cooperate
join
participate
labour
work
___
deal
cope
manage
grapple
get_by
get_through
___
coincide
correlate
alternate
flip-flop
co-occur
___
banter
bargain
coexist
collaborate
collide
commiserate
communicate
compromise
concur
confabulate
confer
cooperate
correspond
decide
deliberate
dissent
disagree
flirt
haggle
hobnob
interact
intermix
mingle
mix
neck
negotiate
parley
plot
rendezvous
renegotiate
reunite
agree
debate
argue
___
carry
cost
last
net
take
___
arch
bare
bat
beat
blow
clench
click
close
cock
crane
crook
cross
drum
flap
flash
flex
flick
flutter
fold
gnash
grind
hang
hunch
kick
knit
open
pucker
purse
raise
roll
rub
shake
show
shuffle
smack
snap
stamp
stretch
toss
turn
twiddle
twitch
wag
waggle
wiggle
wring
wrinkle
___
coin
compose
compute
concoct
construct
contrive
cowrite
create
derive
fabricate
form
formulate
improvise
invent
manufacture
mass-produce
model
organize
produce
recreate
rebuild
style
synthesize
lay
author
draft
write
piece_together
conjure
craft
design
dig
mint
publish
rearrange
reconstitute
reorganize
schedule
stage
___
bob
bow
curtsey
genuflect
kneel
salaam
salute
___
chip
chop
clip
cut
hack
hew
rip
saw
scarify
scrape
scratch
slash
slice
snip
ream
___
deaccent
debark
debone
debowel
debug
debur
declaw
decontaminate
defang
defat
defeather
deflea
deflesh
deflower
defoam
defog
deforest
defrost
defuzz
degas
degerm
deglaze
degrease
degrit
degum
degut
dehair
dehead
dehorn
dehull
dehusk
deice
deink
delint
delouse
deluster
demast
derat
derib
derind
desalt
descale
desex
desprout
destarch
destress
detassel
detusk
devein
dewater
dewax
deworm
disembowel
eviscerate
___
maintain
prove
declare
find
judge
profess
proclaim
___
dedicate
devote
commit
___
reason
reason_out
conclude
derive
disprove
infer
deduct
deduce
gather
conceive
prove
rationalize
___
defend
insure
protect
shade
preserve
guard
safeguard
___
annihilate
blight
blitz
damage
decimate
demolish
desecrate
destroy
devastate
disfigure
efface
exterminate
extirpate
level
louse_up
maim
mutilate
obliterate
rack
ravage
raze
ruin
shipwreck
smoke
undo
unmake
vaporize
waste
wrack
wreck
shatter
___
consume
devour
down
have
imbibe
ingest
swill
take
___
branch
deviate
differ
diverge
vary
___
banquet
breakfast
brunch
dine
feast
graze
junket
lunch
luncheon
nosh
picnic
snack
sup
___
die
disappear
expire
lapse
perish
vanish
___
carve
detach
disassemble
disconnect
dismantle
dismount
pare
partition
segregate
sift
slice
sunder
unbolt
unbuckle
unbutton
unchain
unclamp
unclasp
unclip
unfasten
unfix
unglue
unhinge
unhitch
unhook
unlace
unlatch
unlock
unleash
unpeg
unpin
unscrew
unseal
unshackle
unstaple
unstitch
untie
unzip
sieve
___
deduce
determine
discover
find
guess
realize
ascertain
rationalize
relearn
see
scent_out
solve
chance_across
chance_on
pick_up
hear
learn
read
study
find_out
figure_out
___
bathe
change
clothe
disrobe
dress
exercise
frock
lave
moisturize
preen
primp
shave
shower
strip
sunbathe
tan
unclothe
undress
wash
___
doll
dress
gussy
spruce
tog
trick
___
bike
drive
row
motor
paddle
tool
tool_around
trundle
wheel
barge
bus
cart
ferry
fly
shuttle
truck
___
call
decree
dub
make
pronounce
rename
rule
stamp
term
vote
anoint
baptize
brand
christen
consecrate
crown
label
name
nickname
style
___
eat
drink
huff
inject
mainline
snort
shoot_up
smoke
use
___
empathize
sympathize
identify
commiserate
___
control
enforce
impose
___
beget
bring_about
cause
create
engender
generate
incite
inspire
instigate
kindle
produce
provoke
set_off
shape
sire
spark
spawn
actuate
arouse
call_forth
elicit
prompt
stimulate
stir_up
trigger
___
ensure
assure
guarantee
insure
secure
ascertain
reinsure
___
billow
bloom
blossom
bristle
bulge
burn
effervesce
fester
fizz
flow
flower
flux
foam
froth
moil
propagate
rage
ripple
roil
seethe
smolder
sprout
apostatize
atrophy
blister
bloom
blossom
bud
burgeon
burn
corrode
crust
decay
decompose
deteriorate
ebb
erode
ferment
fester
flower
foliate
germinate
green
molder
molt
moult
oxidize
phosphoresce
progress
putrefy
rot
rust
spoil
sprout
stagnate
subside
suppurate
swell
tarnish
wane
wilt
wither
pullulate
___
charge
invest
ply
arm
equip
outfit
rearm
redress
regale
reward
saddle
treat
armor
encumber
fortify
overburden
weight
burden
compensate
___
advance
approach
come
decamp
fall
file
go
plunge
recede
return
rise
tumble
arrive
set_off
set_out
bolt
emerge
emigrate
retreat
skedaddle
vamoose
withdraw
depart
disembark
escape
exit
flee
leave
vacate
enter
approach
ascend
climb
cross
descend
___
constitute
constitutionalize
innovate
machinate
pioneer
stage
initiate
establish
fake
feign
format
found
plant
implement
instigate
institute
organize
originate
prepare
premise
devise
mount
bring_about
arrange
introduce
simulate
strike_up
synthesise
launch
open
open_up
___
estimate
gauge
approximate
guess
judge
count
quantize
assess
guesstimate
project
___
overcome
overleap
transcend
better
exceed
lap
outbid
outdo
outmatch
outnumber
outrace
outshine
outsmart
outstrip
outweigh
outwit
overreach
overstep
surpass
top
___
barter
forgo
jilt
replace
change
exchange
switch
trade
substitute
swap
___
defecate
exhale
hemorrhage
perspire
expectorate
regurgitate
urinate
whiff
inhale
___
overspread
coexist
dwell
exist
extend
flourish
languish
linger
live
loom
lurk
persist
predominate
prevail
prosper
remain
reside
shelter
stay
thrive
tower
vegetate
wait
persevere
endure
survive
___
bottlefeed
breastfeed
feed
force-feed
handfeed
nurse
spoonfeed
suckle
___
ferret
nose
tease
___
anoint
bandage
bestrew
blacktop
blockade
blot
bombard
choke
clog
close
clutter
contaminate
dam
deluge
dirty
dope
dot
embellish
emblazon
encircle
endow
enrich
fill
fleck
flood
garland
garnish
grace
gum_up
honeycomb
imbue
impregnate
infect
infest
inlay
interlace
interlard
interleave
intersperse
interweave
inundate
lard
lash
litter
mask
mottle
ornament
pad
plate
plug
prefill
replenish
repopulate
resupply
riddle
ring
ripple
sauce
season
smut
soil
splotch
staff
stipple
stop_up
stud
suffuse
sully
taint
tinge
inject
adorn
bathe
bind
blanket
block
carpet
cloak
coat
cover
dapple
deck
decorate
disguise
douse
drench
edge
encrust
entangle
face
festoon
frame
line
marinate
panel
pave
redecorate
robe
saturate
shroud
smother
soak
speckle
spot
surround
swaddle
swathe
tile
tool
trim
veil
vein
stain
___
fire
dismiss
sack
drop
unseat
oust
expel
remove
can
send_away
suspend
force_out
terminate
give_the_boot
lay_off
let_go
shitcan
___
carry
contain
fit
feed
hibernate
hold
house
reseat
seat
serve
sleep
store
take
use
___
balk
cower
cringe
flinch
quail
recoil
shrink
wince
___
brush
floss
shave
wash
___
focus
focalize
center
concentrate
contemplate
converge
dwell
fixate
brood
deliberate
meditate
muse
ponder
reflect
ruminate
think
wonder
___
dissuade
keep
ban
bar
block
deter
discourage
forbid
hamper
hinder
impede
inhibit
obstruct
preclude
prevent
prohibit
restrain
stop
___
bullock
bamboozle
coax
coerce
commission
compel
convince
cozen
dare
draw
encourage
entice
force
goad
impel
incite
induce
inveigle
jolt
lead
mislead
motivate
obligate
oblige
palaver
persuade
press
pressure
prod
prompt
push
rush
rouse
fox
soothe
spur
steamroller
suborn
sway
sweet-talk
talk_into
talk_out_of
tempt
win_over
bullshit
sandbag
railroad
dragoon
hound
allure
annoy
arm-twist
bait
bluff
blackmail
bribe
bully
cajole
cheat
commander
con
deceive
delude
draw
drive
dupe
ensnare
entrap
flatter
fool
frighten
guide
harass
harry
hijack
hoodwink
hustle
influence
seduce
lure
manipulate
organize
panic
set
shame
shock
stimulate
talk
tease
terrify
trap
trick
wheedle
___
alleviate
liberate
discharge
exonerate
absolve
acquit
clear
free
cure
relieve
emancipate
release
rerelease
___
issue
leave
present
trust
credit
entrust
furnish
resupply
serve
supply
provide
___
dip
dunk
ladle
hoe
scoop
siphon
sop
channelize
channel
fit
rake
scrape
shovel
spoon
squash
squish
tuck
wipe
wring
bang
dump
funnel
hammer
pound
push
ram
shake
squeeze
sweep
wedge
___
advance
allocate
allot
apportion
assign
award
bequeath
cede
concede
devolve
extend
grant
guarantee
issue
leave
offer
owe
portion
promise
ration
reallocate
reassign
vote
will
yield
accord
___
attain
book
buy
call
catch
charter
choose
conserve
find
gather
hire
lease
order
phone
pick
pluck
procure
pull
reach
rent
reserve
shoot
slaughter
vote
win
earn
fetch
cash
gain
get
save
score
secure
steal
___
deal
lend
loan
pass
peddle
refund
render
give
hock
hawk
rent
sell
lease
pawn
___
bolt
gobble
wolf
gulp
guzzle
quaff
slug
swallow
swig
___
exist
feed
flourish
gorge
prosper
subsist
survive
thrive
___
cleanse
curry
groom
neaten
___
develop
evolve
generate
grow
hatch
maturate
mature
redevelop
___
support
succor
aid
abet
assist
help
___
accumulate
aggregate
amass
assemble
cluster
collect
congregate
convene
flock
gather
group
herd
huddle
mass
reconvene
___
belch
blink
blush
burp
eruct
fart
flush
hiccup
pant
salivate
shiver
sneeze
sniffle
snore
snuff
snuffle
swallow
wheeze
yawn
___
hire
recruit
employ
contract
engage
take
sign
sign_on
sign_up
subcontract
train
enlist
reinstate
___
bang
bash
click
dash
squash
tamp
thump
thwack
whack
smite
batter
beat
bump
butt
drum
hammer
hit
jab
kick
knock
lash
pound
rap
slap
smack
smash
strike
stomp
whang
tap
___
clasp
clutch
grab
grasp
grip
handle
hold
pull
push
seize
tug
wield
yank
___
dig
feel
fish
hunt
mine
pan
poach
scrounge
seek
___
hit
jam
graze
chafe
stub
break
chip
fracture
pull
rupture
split
splinter
sprain
tear
turn
twist
bark
bite
bruise
bump
burn
contuse
cut
hurt
injure
nick
prick
scald
scratch
skin
strain
sunburn
wrench
___
address
adorn
autograph
bead
brand
date
decorate
embellish
endorse
gild
ice
illuminate
illustrate
initial
label
letter
monogram
ornament
redecorate
tag
___
annotate
applique
emboss
embroider
engrave
etch
handpaint
imprint
incise
ingrain
inscribe
mark
paint
reinscribe
scar
set
sign
stamp
stipple
tattoo
tool
___
imply
predict
denote
corroborate
expose
prognosticate
forebode
anticipate
explain
indicate
say
affirm
reaffirm
disclose
verify
confirm
demonstrate
establish
prove
reveal
show
___
ask
enquire
inquire
consult
pry
___
broadcast
cable
e-mail
fax
modem
netmail
phone
radio
relay
satellite
semaphore
sign
signal
telecast
telegraph
telephone
telex
wire
wireless
___
cross-examine
question
interview
interrogate
___
canvass
explore
examine
frisk
inspect
investigate
monitor
observe
picket
quiz
raid
ransack
riffle
scan
scrutinize
surveil
survey
tap
test
tour
___
involve
engage
relate
include
enroll
___
abuse
assault
backbite
blame
blaspheme
condone
find_fault_with
gibe
imprecate
repay
slang
accurse
applaud
approve
assail
attack
badmouth
belittle
berate
besmirch
bless
calumniate
castigate
celebrate
censure
chasten
chastise
chide
cite
commemorate
commend
compensate
compliment
condemn
congratulate
criticize
curse
damn
decry
defame
denigrate
denounce
deprecate
deride
disparage
eulogize
excoriate
excuse
extol
fault
felicitate
forgive
glorify
greet
honor
impeach
incriminate
indict
insult
lambaste
lampoon
malign
mock
pardon
penalize
persecute
prosecute
punish
rebuke
recommend
recompense
remunerate
reprimand
reproach
reprobate
reprove
repudiate
revile
reward
ridicule
salute
sanction
satirize
scold
scorn
shame
slander
snub
stigmatize
thank
toast
upbraid
vilify
welcome
acclaim
doubt
hail
herald
judge
laud
praise
___
hoard
keep
leave
store
stock
stockpile
___
ball
beat
bend
coil
collect
compress
contort
curve
distort
fold
flex
flux
knead
melt
shake
squash
squeeze
squish
twirl
twist
wad
whip
wind
work
___
cram
read
relearn
study
learn
glean
memorize
assimilate
learn
read
___
abandon
split
desert
leave
___
lecture
moralize
preach
rant
remark
speak
talk
testify
theorize
write
pontificate
elaborate
comment
dwell
___
beam
blaze
blink
burn
flame
flare
flash
flicker
fluoresce
glare
gleam
glimmer
glint
glisten
glitter
glow
incandesce
scintillate
shimmer
shine
sparkle
twinkle
___
confine
limit
reduce
restrict
restrain
constrain
___
dally
dawdle
dither
equivocate
hesitate
linger
loaf
loiter
pause
potter
procrastinate
putter
tarry
delay
scruple
stall
___
barrack
bivouac
board
bunk
camp
dwell
guest
live
lodge
overnight
quarter
reside
room
settle
shack_up
shelter
sleep_over
squat
stay_over
stop
stay
___
ache
crave
fall
hanker
hope
hunger
itch
long
lust
pine
pray
thirst
wish
yearn
dangle
hanker
lust
thirst
yearn
___
babble
bark
bawl
bellow
bleat
blubber
boom
bray
burble
bluster
cackle
call
carol
chant
chatter
chirp
chortle
chuckle
cluck
coo
croak
croon
crow
cry
drawl
drone
gabble
gasp
gibber
groan
growl
grumble
grunt
hiss
holler
hoot
howl
jabber
keen
lilt
lisp
mewl
moan
mumble
murmur
mutter
nasal
natter
pant
prattle
purr
quaver
rage
rant
rasp
roar
rumble
scream
screech
shout
shriek
sibilate
simper
sigh
sing
smatter
smile
snap
snarl
snivel
snuffle
splutter
squall
squawk
squeak
squeal
stammer
stemmer
stutter
thunder
tisk
trill
trumpet
twang
twitter
vociferate
wail
warble
wheeze
whimper
whine
whisper
whistle
witter
whoop
yammer
yap
yell
yelp
yodel
blare
gurgle
hum
___
court
cuddle
date
divorce
embrace
hug
kiss
marry
nuzzle
pet
___
cheer
cringe
enthuse
exult
fume
gladden
madden
marvel
rage
rejoice
sadden
sicken
start
swoon
thrill
wonder
flip_out
freak_out
go_apeshit
go_ballistic
lose_it
chafe
bother
care
fret
mind
moon
rage
rejoice
rhapsodize
stew
stress
sulk
worry
flip_out
freak_out
go_apeshit
go_ballistic
lose_it
bleed
care
cry
fear
feel
grieve
mourn
weep
ache
hurt
suffer
bask
delight
exult
glory
luxuriate
rejoice
revel
wallow
approve
beware
despair
disapprove
sicken
tire
weary
groove
agonize
anger
anguish
delight
enthuse
exult
fret
fume
gloat
grieve
gush
hallucinate
hunger
marvel
meditate
moon
mope
mourn
muse
obsess
puzzle
rage
rave
reflect
rejoice
rhapsodize
ruminate
salivate
seethe
triumph
wonder
worry
sorrow
flip_out
freak_out
go_apeshit
go_ballistic
lose_it
chafe
react
thrill
___
behave
count
function
masquerade
officiate
qualify
rank
act
behave
serve
pose
___
matter
count
___
angle
ascend
bend
cascade
climb
crawl
crest
crisscross
cross
cut
descend
dip
dive
drop
edge
emerge
go
meander
lance
mount
pass
plummet
plunge
rise
round
run
skirt
slant
snake
straggle
stretch
sweep
tumble
turn
twist
undulate
wander
weave
wind
range
swerve
veer
zag
zig
zigzag
converge
___
consult
deliberate
meet
play
remonstrate
reunite
visit
battle
box
debate
fight
___
mine
quarry
___
admix
consolidate
intermix
scramble
tumble
cream
amalgamate
blend
coalesce
combine
compound
commingle
decoct
fuse
meld
merge
mingle
mix
recombine
add
tie
connect
join
link
pair
pool
network
rejoin
unite
___
bob
bow
circulate
creep
dance
drift
eddy
falter
flap
float
flutter
hover
jiggle
joggle
oscillate
pulsate
pulse
quake
quiver
recirculate
revolve
rock
rotate
shake
stir
swag
sway
swirl
teeter
throb
totter
tremble
undulate
vacillate
vibrate
waft
wave
waver
wiggle
wobble
worm
writhe
roil
___
sum
add
tally
count
multiply
divide
deduct
factor_out
interpolate
extrapolate
subtract
average
___
annihilate
assassinate
bushwhack
butcher
dispatch
eliminate
euthanize
execute
exterminate
immolate
liquidate
lynch
massacre
murder
off
slaughter
slay
kill
___
omit
neglect
fail
forego
forgo
flub
overleap
manage
___
cruise
drive
fly
navigate
oar
paddle
pedal
rally
ride
row
sail
tack
voyage
wing
___
beam
blubber
cackle
chortle
chuckle
cough
cry
frown
gape
gasp
gawk
giggle
glare
glower
goggle
grimace
grin
groan
growl
guffaw
howl
jeer
laugh
lour
moan
pout
scoff
scowl
sigh
simper
smile
smirk
sneer
sneeze
snicker
sniff
snigger
snivel
snore
snort
sob
titter
weep
whistle
yawn
hem
___
accept
accrue
accumulate
appropriate
borrow
cadge
commandeer
collect
exact
grab
inherit
make
receive
recoup
recover
regain
retrieve
seize
select
snatch
source
subselect
arrogate
acquire
obtain
purchase
___
ensue
eventuate
follow
happen
occur
recur
result
take_place
transpire
befall
chance
develop
pass
___
allow
beseech
call
hail
invite
okay
permit
summon
ask
command
demand
order
require
___
apprentice
beggar
cripple
cuckold
knight
martyr
orphan
outlaw
pauper
recruit
whore
widow
___
abate
abbreviate
abrade
abridge
accelerate
acetify
acidify
activate
advance
age
agglomerate
air
alkalify
alkalize
alter
ameliorate
americanize
amplify
anglicize
atomize
attenuate
augment
balance
blacken
beautify
bifurcate
bisect
bleach
blunt
blur
bolshevize
brighten
broaden
burn
burst
calcify
capsize
caramelize
carbonize
centralize
change
char
cheapen
cheer_up
chill
civilize
clarify
clean
clear
clog
close
cloud
coagulate
coarsen
collapse
collect
combust
compress
compact
condense
congeal
contract
constrict
cool
corrode
corrugate
corrupt
crimson
crisp
crumble
crystallize
curdle
dampen
darken
de-escalate
decelerate
decentralize
decompress
decrease
deepen
deflate
deflect
defrost
degenerate
degrade
dehydrate
demagnetize
democratize
depressurize
derail
desiccate
destabilize
deteriorate
detonate
devalue
diffuse
dilate
dilute
dim
diminish
dirty
disband
discolor
disintegrate
disperse
dissipate
dissolve
diversify
divide
double
downshift
drain
dull
ease
effeminate
emaciate
empty
emulsify
energize
enlarge
equalize
equilibrate
escalate
evaporate
even
exfoliate
expand
explode
fade
famish
fatten
federate
feminize
fill
firm
flatten
flood
fluff
fossilize
fray
freckle
freshen
frost
fructify
fuse
gasify
gelatinize
gentrify
germanize
gladden
globalize
glutenize
granulate
gray
grow
halt
harden
harmonize
hasten
heal
heat
heighten
hellenize
hush
hybridize
hydrolize
hydrate
ignite
improve
increase
incubate
indurate
industrialize
inflate
intensify
internationalize
ionize
kindle
laminate
lengthen
lessen
level
levitate
liberalize
lignify
liquefy
liquify
liven
loop
loose
loosen
macerate
mature
mellow
metabolize
mitigate
mobilize
moderate
modernize
modify
modulate
moisten
multiply
mummify
narrow
nationalize
naturalize
neutralize
normalize
occlude
open
operate
ossify
overturn
oxidize
pale
petrify
plump
polarize
polymerize
pop
privatize
proliferate
propagate
pulverize
puncture
purify
purple
putrefy
quadruple
quicken
quiet
quieten
rarefy
redden
redouble
refine
reform
rekindle
renew
reopen
replicate
reproduce
resuscitate
reverse
revive
ripen
root
roughen
rupture
saponify
scorch
sear
section
sensitize
sharpen
short
short-circuit
shorten
shrink
shrivel
shush
shut
sicken
silicify
silver
sink
slack
slacken
slim
slow
smarten
smooth
smoothen
soak
sober
soften
solidify
sour
souse
sprout
stabilize
standardize
steady
steep
steepen
stiffen
stratify
strangulate
strengthen
submerge
sunburn
sweeten
tame
tan
taper
tatter
tauten
tenderize
tense
thicken
thin
tighten
tilt
tire
tone
topple
toughen
tranquilize
treble
trip
triple
ulcerate
unionize
upload
vaporize
vary
vibrate
vitrify
volatilize
vulcanize
wake
waken
warm
weaken
westernize
wet
whiten
wizen
widen
worsen
yellow
awake
awaken
dry
freeze
melt
thaw
___
overstate
overdraw
hyperbolize
magnify
amplify
overemphasize
overrate
overstress
tout
glorify
___
have
own
possess
___
ail
bother
burn
hurt
itch
pain
wrench
___
copyright
patent
trademark
license
register
certify
credential
accredit
verify
evidence
imitate
impersonate
___
spend
squander
waste
serve
tithe
pay
repay
___
attend
check
eavesdrop
gape
gawk
gaze
glance
glare
goggle
leer
listen
look
ogle
peek
peep
peer
sniff
snoop
squint
stare
___
bombard
buffet
pelt
pepperspray
shell
shower
stone
___
belt
chant
direct
enact
improvise
intone
perform
vocalize
scriptwrite
dance
hum
play
recite
rap
sing
whistle
heel
choreograph
compose
produce
silkscreen
take
draw
paint
replay
spin
write
___
bark
beard
bone
burl
core
gill
gut
head
hull
husk
lint
louse
milk
peel
pinion
pip
pit
pith
pod
poll
pulp
rind
scale
scalp
seed
shell
shuck
skin
snail
stalk
stem
stone
string
tail
tassel
vein
weed
wind
worm
zest
___
archive
bag
bank
barrack
beach
bed
bench
billet
bin
bottle
box
cage
can
case
cellar
cloister
coop
corral
crate
cup
file
fork
garage
hangar
house
imprison
jail
jar
jug
kennel
pasture
pen
pillory
pocket
pot
sheathe
shelve
shoulder
skewer
snare
spindle
spit
spool
string
tassel
tin
trap
tree
warehouse
wharf
berth
dock
drydock
land
moor
ground
lodge
stable
___
asphyxiate
behead
bullet
crucify
dart
decapitate
disembowel
drown
electrocute
evicerate
gas
garrotte
hang
impale
knife
poison
shoot
smother
stab
stone
strangle
strangulate
suffocate
throttle
___
dig
jab
pierce
poke
prick
stab
stick
___
dribble
drip
pour
slop
slosh
spew
spill
trickle
___
bake
blend
brew
clear
cook
cook_up
fix
invent
kindle
light
mix
prepare
ready
roll
run
toss
cultivate
barbeque
barbecue
boil
broil
clean
fry
grill
hardboil
iron
microwave
overbake
poach
pour
roast
scramble
set
softboil
toast
wash
weld
___
appraise
approximate
assess
auction
calibrate
estimate
fix
gauge
meter
overestimate
peg
price
rate
reappraise
value
___
assure
guarantee
promise
ascertain
___
promote
advance
boost
further
encourage
invite
emphasize
underscore
___
heave
jerk
pull
tug
yank
jostle
nudge
press
push
shove
squeeze
thrust
___
lay
prop
underlay
dangle
hang
lean
perch
rest
sit
stand
suspend
drop
elevate
heel
hoist
lift
lower
raise
back
arrange
emplace
immerse
implant
lodge
mount
position
situate
sling
station
superimpose
tack_on
wharf
apply
bury
deposit
embed
insert
install
park
plant
reinstall
stash
stow
place
put
set
stick
___
reach
hit
make
breast
___
announce
assert
declare
define
display
exhibit
expose
express
flaunt
form
intrude
manifest
offer
pose
present
proffer
propose
reassert
recommend
reveal
shape
show
suggest
___
refrain
abstain
desist
forbear
___
clock
time
mistime
measure
read
register
total
weigh
___
rehearse
practice
walk_through
exercise
repeat
___
involve
concern
touch
bear_on
touch_on
refer
pertain
relate
___
rely
depend
bank
bargain
count
figure
reckon
bet
gamble
take_a_chance
wager
___
abase
africanize
alcoholize
alleviate
anesthetize
animate
backfill
bastardize
bedew
blast
blemish
bloody
botch
bowdlerize
bungle
capacitate
carbonify
castrate
categorize
catholicize
cauterize
chamfer
chlorinate
christianize
circumcise
circumscribe
coif
commercialize
configure
conflate
constipate
constringe
construct
contextualize
correct
counteract
cremate
deafen
debase
deconstruct
dehumidify
delineate
demean
dement
demobilize
desalinate
desensitize
diffract
disable
dishevel
disinfect
disinter
dispel
dislocate
disorganize
domesticate
edify
emasculate
embitter
embrocate
enhance
enunciate
eternalize
eternize
europeanize
exacerbate
exhume
expropriate
extinguish
fanaticize
federalize
fertilize
flouridate
fortify
grade
halve
homogenize
humanize
humidify
hydrogenate
ice
immortalize
inactivate
incinerate
inseminate
inspissate
invert
iodize
light
lighten
magnetize
magnify
manure
marginalize
mechanize
medicate
militarize
mineralize
miniaturize
minimize
mishandle
mismanage
motorize
muddy
mummify
mute
nasalize
nitrify
objectify
obscure
obviate
overshadow
oxygenate
paralyze
pasteurize
perfect
perpetuate
pink
pollard
popularize
prejudge
prettify
publicize
reanimate
rectify
redact
refract
regularize
remaster
remedy
repair
revise
secularize
sensationalize
shortchange
silence
singe
sinter
sovietize
sterilize
streamline
subvert
sulfurize
tabulate
taiwanize
tart_up
tousle
transplant
traumatize
truncate
trivialize
underfeed
upload
urbanize
ventilate
vulgarize
___
abolish
abstract
cull
deburr
deduct
delete
depose
disgorge
dislodge
disengage
draw
eject
eliminate
eradicate
excise
excommunicate
expel
extirpate
extract
extrude
lop
omit
ostracize
partition
pry
reap
ream
retract
roust
separate
shoo
subtract
take
take_away
take_out
take_off
uproot
winkle
wrench
withdraw
oust
discharge
dismiss
evict
remove
sever
extinguish
prise
___
render
take
make
get
___
take
necessitate
require
involve
demand
need
___
vacate
resign
renounce
leave
quit
abdicate
retire
withdraw
depart
___
bet
gamble
punt
venture
wager
chance
risk
hazard
___
bounce
drift
drop
float
glide
move
nose
roll
slide
swing
coil
revolve
rotate
spin
turn
twirl
twist
whirl
wind
snake
soar
spiral
undulate
___
bore
burrow
fumble
leaf
listen
look
page
poke
scrabble
scratch
forage
grope
rifle
rummage
paw
delve
root
thumb
snoop
tunnel
___
amble
ambulate
backpack
bolt
bound
breeze
bustle
caper
carom
cavort
charge
chunter
clamber
climb
clump
crawl
creep
dodder
flit
flounce
frolic
gallivant
gambol
ghost
globetrot
goose_step
hike
hitchhike
hopscotch
jounce
limp
lollop
lumber
lurch
meander
mince
mosey
nip
pace
pootle
pounce
pussyfoot
repair
roar
romp
sashay
saunter
scamper
scram
scramble
scud
scurry
scutter
scuttle
seesaw
shamble
shuffle
sidle
skedaddle
skid
skulk
sleepwalk
slink
slither
slog
slouch
somersault
sprint
spring
stagger
step
stomp
stray
streak
stumble
stump
swag
swagger
swan
swerve
tear
tiptoe
toddle
toil
tootle
totter
tread
troop
trundle
waddle
weave
wend
whiz
worm
yaw
zigzag
zoom
hop
journey
leap
pad
perambulate
plod
prowl
ramble
roam
rove
stride
stroll
sweep
swim
traipse
tramp
travel
trek
trudge
vault
wade
wander
wing
back
bounce
bowl
canter
coast
dart
dash
drift
float
gallop
glide
hasten
hobble
hurry
hurtle
inch
lope
march
prance
race
roll
scoot
skip
skitter
slide
sneak
speed
strut
tack
trip
trot
fly
jog
jump
march
parade
promenade
run
rush
walk
___
hasten
hurry
rush
___
add
allege
blabber
disclose
divulge
exclaim
insinuate
insist
intimate
leak
reply
respond
retort
promulgate
utter
venture
vocalize
voice
volunteer
write
advise
announce
articulate
blab
blurt
claim
confess
confide
convey
declare
interject
interpose
mention
observe
proclaim
propose
recount
reiterate
relate
reveal
say
state
volunteer
repeat
remark
note
report
purpose
suggest
recommend
hint
___
carve
chalk
charcoal
copy
crayon
doodle
draw
forge
ink
misspell
paint
pencil
plot
print
scratch
scrawl
scribble
sketch
spell
spraypaint
stencil
trace
type
write
print_out
print_up
underscore
underline
___
advertise
check
comb
dive
drag
dredge
excavate
nose
patrol
plumb
probe
prospect
prowl
quarry
rake
rifle
scavenge
scour
scout
search
shop
sift
sweep
trawl
troll
watch
quest
___
smell
taste
detect
discern
feel
sense
perceive
notice
see
hear
___
smell
sound
taste
keep
act
be
feel
look
remain
stay
seem
appear
prove
___
convey
deliver
dispatch
handdeliver
pass_on
port
post
return
shift
shunt
transfer
transport
export
import
transship
airmail
express
FedEx
forward
hand
mail
pass
send
ship
slip
smuggle
sneak
transmit
UPS
wire
___
disassociate
sever
uncoil
decouple
differentiate
disentangle
dissimilate
divide
divorce
segregate
disconnect
dissociate
part
separate
___
settle
concur
contract
harmonize
bargain
consent
cohere
jibe
square
resolve
covenant
___
lump
mass
beat
fuse
scramble
stir
swirl
whip
whisk
band
baste
cluster
collate
collect
fix
gather
glom
group
herd
pair
roll
sew
shake
shuffle
stick
attach
bind
bond
bundle
concatenate
fasten
graft
jumble
ligate
moor
package
secure
splice
toggle
weld
fixate
affix
agglutinate
___
behold
descry
discover
espy
experience
eye
glimpse
know
make_out
note
observe
overhear
perceive
recognize
savor
scent
scent_out
sight
spot
spy
view
witness
sniff
___
don
doff
wear
___
move
scoot
bounce
dart
float
roll
slide
___
reek
smell
stink
___
catnap
doze
drowse
nap
sleep
slumber
snooze
___
echo
resonate
resound
reverberate
roll
sound
babble
bang
beat
beep
bellow
blare
blast
blat
boom
bubble
burble
burr
buzz
caterwaul
chatter
chime
chink
chir
chitter
chug
clack
clang
clank
clap
clash
clatter
click
cling
clink
clomp
clump
clunk
crack
crackle
crash
creak
crepitate
crunch
cry
ding
dong
drone
explode
fizz
fizzle
groan
growl
gurgle
hiss
hoot
honk
howl
hum
jangle
jingle
keen
knell
knock
lilt
mewl
moan
murmur
patter
peal
ping
pink
pipe
plash
plink
plonk
plop
plunk
pop
purr
putter
rap
rasp
rattle
ring
roar
roll
rumble
rustle
scream
screech
shriek
shrill
sing
sizzle
snap
sound
sough
sploosh
splash
splutter
sputter
squawk
squeak
squeal
squelch
strike
swish
swoosh
thrum
thud
thump
thunder
thunk
tick
ting
tinkle
toll
toot
tootle
trill
trumpet
twang
ululate
vroom
wail
wheeze
whine
whir
whish
whisper
whistle
whoosh
whump
zing
babble
bang
beat
beep
bellow
blare
blast
blat
boom
bubble
burble
burr
buzz
caterwaul
chatter
chime
chink
chir
chitter
chug
clack
clang
clank
clap
clash
clatter
click
cling
clink
clomp
clump
clunk
crack
crackle
crash
creak
crepitate
crunch
cry
ding
dong
drone
explode
fizz
fizzle
groan
growl
gurgle
hiss
hoot
honk
howl
hum
jangle
jingle
keen
knell
knock
lilt
mewl
moan
murmur
patter
peal
ping
pink
pipe
plash
plink
plonk
plop
plunk
pop
purr
putter
rap
rasp
rattle
ring
roar
roll
rumble
rustle
scream
screech
shriek
shrill
sing
sizzle
snap
sound
sough
sploosh
splash
splutter
sputter
squawk
squeak
squeal
squelch
strike
swish
swoosh
thrum
thud
thump
thunder
thunk
tick
ting
tinkle
toll
toot
tootle
trill
trumpet
twang
ululate
vroom
wail
wheeze
whine
whir
whish
whisper
whistle
whoosh
whump
zing
___
bayonet
belt
biff
birch
bludgeon
bonk
brain
bump
cane
clobber
clout
club
conk
cosh
crack
crunch
cudgel
cuff
elbow
flagellate
flog
gash
knee
knife
k.o.
paddle
paddywhack
pummel
slam
sock
spank
stabb
strap
thrash
thump
truncheon
wallop
whip
whisk
horsewhip
___
balance
bend
bow
crouch
dangle
droop
flop
fly
hang
hover
huddle
hunch
jut
kneel
lean
lie
loll
loom
lounge
nestle
open
perch
plop
project
protrude
recline
repose
rest
rise
roost
sag
sit
slope
slouch
slump
sprawl
squat
stand
stoop
straddle
swag
swing
tilt
tower
yaw
___
pass
serve
misspend
___
blow
break
cut
draw
hack
hew
kick
knock
pry
pull
push
rip
roll
saw
shove
slip
sliver
snap
split
tear
tug
yank
___
overload
baste
brush
drizzle
hang
plaster
pump
rub
scatter
seed
sew
shower
smear
smudge
sow
spatter
splash
splatter
spray
spread
sprinkle
spritz
squirt
stick
strew
string
swab
swash
spurt
wrap
cram
crowd
jam
pack
pile
drape
load
dab
daub
mound
dust
heap
plant
seed
slather
stack
stock
stuff
___
scent
smell
stalk
taste
track
whiff
___
abduct
annex
cabbage
carjack
commandeer
confiscate
emancipate
embezzle
extort
filch
highjack
kidnap
knock_off
liberate
lift
misappropriate
nobble
pickpocket
pinch
plagiarize
purloin
recapture
reclaim
recoup
redeem
repossess
rescue
rustle
seize
snatch_away
sequester
take
thieve
weasel_out
wrest
cadge
capture
cop
flog
grab
hook
nab
nick
pilfer
pirate
salvage
shoplift
smuggle
snatch
sneak
steal
swipe
wangle
___
feel
look
smell
sound
taste
___
close
terminate
halt
repeat
cease
conclude
end
finish
stop
___
disenfranchise
enslave
mob
nourish
suppress
stamp_down
subdue
conquer
curb
crush
stifle
dampen
suffocate
choke
hush
silence
still
shut_up
hush_up
lull
calm_down
gag
muzzle
squelch
quell
quench
smother
muffle
repress
quash
keep_down
subjugate
reduce
slake
strangle
kill
___
bead
belch
bubble
dribble
drip
drool
emanate
exrete
exude
foam
gush
jet
leak
ooze
percolate
pour
puff
radiate
seep
shed
slop
spew
spill
spout
sprout
spurt
squirt
steam
stream
sweat
trickle
bleed
___
succeed
excel
manage
fail
flub
___
asphyxiate
choke
drown
starve
stifle
suffocate
___
suspect
accuse
condemn
___
maintain
sustain
prolong
protract
keep
keep_up
continue
carry_on
___
bustle
crawl
creep
hop
run
swarm
swim
teem
pullulate
throng
abound
___
bite
chop
claw
kick
paw
peck
punch
scratch
slice
slug
stab
swat
swipe
___
speak
talk
___
affix
anchor
band
belt
bond
bolt
bracket
buckle
button
cable
cement
chain
cinch
connect
epoxy
fasten
fetter
glue
gum
handcuff
harness
hinge
hitch
hook
knot
lace
lash
lasso
latch
leash
link
lock
loop
manacle
moor
muzzle
nail
padlock
paste
peg
pin
plaster
rivet
rope
screw
seal
shackle
skewer
solder
staple
stitch
strap
string
suture
tack
tape
tether
thread
thumbtack
tie
trammel
truss
weld
wire
yoke
zip
clamp
clip
clasp
gum
paste
reeve
___
acquaint
inform
apprise
notify
advise
update
remind
tell
___
cast
discard
drive
bash
bat
bunt
chuck
fire
flick
fling
flip
hit
hurl
knock
lob
loft
nudge
pass
pitch
punt
shoot
shove
slam
slap
sling
smash
tap
boot
catapult
kick
launch
throw
tip
toss
___
ache
burn
hum
palpitate
pound
prickle
pucker
reel
smart
spin
split
sting
swim
throb
tickle
tingle
twinge
___
caress
fondle
grasp
graze
grip
grope
kiss
knead
lick
massage
nudge
osculate
pat
paw
peck
pet
pinch
prod
rub
squeeze
sting
stroke
tickle
touch
tug
tweak
twinge
wring
chafe
___
chart
chronicle
copy
document
duplicate
film
forge
microfilm
photocopy
photograph
record
tally
tally_up
tape
televise
transcribe
type
videotape
___
demonstrate
elucidate
explain
explicate
expound
justify
narrate
pose
preach
recap
recite
relay
sniff
illustrate
verify
corroborate
communicate
outline
summarize
sum_up
boil_down
snitch
dictate
quote
read
show
teach
tell
write
___
try
attempt
intend
___
alter
deform
metamorphose
morph
mutate
transform
translate
transmute
change
convert
turn
___
admonish
advise
ask
badger
beg
egg_on
entreat
exhort
extort
lobby
urge
implore
press
___
use
utilize
apply
employ
exert
exploit
reuse
___
balloon
boat
bobsled
bus
cab
caravan
chariot
coach
dogsled
ferry
gondola
helicopter
jeep
jet
moped
motor
parachute
punt
rickshaw
rocket
sledge
sleigh
taxi
tram
trolley
yacht
bicycle
bike
canoe
cycle
kayak
motorbike
motorcycle
raft
skate
skateboard
ski
sled
toboggan
take
sail
coast
___
annul
quash
void
avoid
invalidate
nullify
___
boogie
bop
cancan
clog
conga
dance
foxtrot
jig
jitterbug
jive
pirouette
polka
quickstep
rumba
samba
shuffle
squaredance
tango
tapdance
waltz
___
covet
crave
desire
fancy
love
enjoy
want
need
like
prefer
desire
___
blow
bucket
clear
drizzle
fog
frost
freeze
gust
hail
howl
lightning
mist
mizzle
pelt
pour
precipitate
rain
roar
shower
sleet
snow
spit
spot
sprinkle
storm
swelter
teem
thaw
thunder
___
December
holiday
honeymoon
junket
overnight
sojourn
summer
vacation
weekend
winter
___
wag
beckon
blink
clap
gesture
nod
point
shrug
squint
wave
wink
___
file
filter
hoover
iron
plough
sandpaper
sponge
squeegee
towel
brush
comb
hose
mop
plow
rake
shear
shovel
siphon
vacuum
buff
distill
distil
exorcise
expunge
expurgate
flush
leach
offload
polish
purge
shave
smooth
skim
soak
strain
trim
unload
weed
whisk
winnow
wring
bail
dab
dust
erase
lick
pluck
prune
rinse
rub
scour
scrape
scratch
scrub
squeeze
strip
suck
suction
swab
sweep
wash
wear
wipe
___
expect
wish
intend
mean
plan
propose
think
aim
dream
imagine
yen
___
back_out
chicken_out
get_out
wriggle_out
bow_out
pull_out
get_away
back_off
withdraw
retreat
pull_away
retire
___
